# Exerxises 1

3) Create a function named get_db_url. 

It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [95]:
import pandas as pd
from sqlalchemy import text, create_engine
import numpy as np
from env import get_connection

4) Use your function to obtain a connection to the employees database.

In [96]:
url = get_connection('employees')

In [97]:
engine =  create_engine(url)

5) Once you have successfully run a query:

In [98]:
query = '''
        SELECT *
        FROM employees
        '''

In [99]:
text_query = text(query)

In [129]:
df = pd.read_sql(text(query), engine.connect())
df.head(10)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01
5   10005     Senior Staff  1996-09-12  9999-01-01
6   10005            Staff  1989-09-12  1996-09-12
7   10006  Senior Engineer  1990-08-05  9999-01-01
8   10007     Senior Staff  1996-02-11  9999-01-01
9   10007            Staff  1989-02-10  1996-02-11

# A.
Intentionally make a typo in the database url. What kind of error message do you see?

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'somerville_2278'@'%%' to database 'emploees'")

(Background on this error at: https://sqlalche.me/e/14/e3q8)

# B. 
Intentionally make an error in your SQL query. What does the error message look like?

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emploees' doesn't exist")

[SQL: 
        Select *
        From emploees
        ]
        
(Background on this error at: https://sqlalche.me/e/14/f405)

6) Read the employees and titles tables into two separate DataFrames.

In [101]:
query = '''
        SELECT *
        FROM employees
        '''

In [103]:
employees_df = pd.read_sql(text_query, engine.connect())
employees_df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [104]:
query = '''
        SELECT *
        FROM titles
        '''

In [105]:
titles_df = pd.read_sql(text(query), engine.connect())
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

7) How many rows and columns do you have in each DataFrame? Is that what you expected?

In [107]:
#employees
employees_df.shape

(300024, 6)

In [108]:
#titles
titles_df.shape

(443308, 4)

8) Display the summary statistics for each DataFrame.

In [111]:
#employees
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [112]:
#titles
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

9) How many unique titles are in the titles DataFrame?

In [121]:
titles_df.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10) What is the oldest date in the to_date column?

In [122]:
titles_df.to_date.max()

datetime.date(9999, 1, 1)

11) What is the most recent date in the to_date column?

In [123]:
titles_df.to_date.min()

datetime.date(1985, 3, 1)